# <b>A. <span style='color:#0B2F9F'><code>PREFIX</code></span></b>
Prefix is ​​the use of a prefix in a table name to provide additional information or to group certain objects.  <br>
<br>
The table name is given an alias (assumed) as tbl, then to access the columns in the table you can give the prefix tbl.column1 and so on.

#### <i><b><span style='color:#55679C'>Example</span> : In the customer_demography table, take the customer_id, gender, age and married columns but use the alias 'cdm' in the table name and attach the prefix when accessing the columns</b></i>

In [ ]:
SELECT
   cdm.gender,
  cdm.age,
  cdm.married
FROM telco_churn.customer_demography AS cdm

# <b>B. <span style='color:#0B2F9F'><code>JOIN</code></span></b>

Data is usually stored in different tables or systems in a Relational Database Management System (RDBMS). JOIN allows users to combine data from different sources to get a more complete picture. Understanding JOIN queries allows a user to integrate and analyze data effectively, thereby improving the quality of analysis and supporting data-driven decision making.

Standard JOIN operations can be performed if there is a key on each of the interconnected tables. The most commonly used basic join operations are 4, namely :
<ul>
    <li><b>LEFT JOIN</b></li>
LEFT JOIN is a type of operation that combines rows from two tables, but returns only all rows from the left table (first table) and matching rows from the right table (second table). If there are no matches in the right table, then the values ​​for the columns from the right table will be filled with NULL..<br><br>
    <img src="https://thomasadventure.blog/img/left-join-extra.gif" width="20%">
    <br><br>
    <li><b>RIGHT JOIN</b></li>
   RIGHT JOIN is a type of operation that combines rows from two tables, but returns only all rows from the right table (second table) and matching rows from the left table (first table). If there are no matches in the left table, then the values ​​for the columns from the left table will be filled with NULL.<br><br>
    <img src="https://thomasadventure.blog/img/right-join.gif" width="20%">
    <br><br>
    <li><b>INNER JOIN</b></li>
    INNER JOIN is a type of join operation that returns only rows that have a match in both tables based on certain criteria.<br><br>
    <img src="https://thomasadventure.blog/img/inner-join.gif" width="20%">
    <br><br>
     <li><b>FULL JOIN</b></li>
   FULL JOIN is a type of operation that combines all rows from both tables, whether they have a match or not. Thus, the result will include all data from the left table and the right table.<br><br>
    <img src="https://thomasadventure.blog/img/full-join.gif" width="20%">
    <br><br>
</ul>

#### <i><b><span style='color:#55679C'>Introduction</span>
To do a join, it is usually easier if the architecture of the relationship between tables or commonly known as ERD (Entity Relational Diagram) has been created or known. In the telco churn data, the ERD is presented in the following image.<br><br>

<img src="https://raw.githubusercontent.com/bachtiyarma/Material/refs/heads/main/Image/Materi-SQL/ERD%20-%20Telco%20Churn.png" width="40%">

#### <i><b><span style='color:#55679C'>Example : </span>Calculate the average monthly cost of each customer status! Show status, total_customer, avg_monthly_charge! Interpret insights from the calculation result

In [ ]:
SELECT
	  sts.status,
	  COUNT(sts.customer_id) AS total_customer,
	  ROUND(AVG(srv.monthly_charge), 2) AS avg_monthly_charge
	FROM telco_churn.customer_status sts
	LEFT JOIN telco_churn.telco_services srv ON sts.customer_id = srv.customer_id
	GROUP BY sts.status

#### <i><b><span style='color:#55679C'>Example : </span>Calculate how many customers, average monthly charge & average age of each customer status, gender and marital status! Show status, gender, married, total_customer, avg_monthly_charge! Sort the results by calculation metrics

In [ ]:
SELECT
  sts.status,
  dmg.gender,
  dmg.married,
  COUNT(sts.customer_id) AS total_customer,
  ROUND(AVG(srv.monthly_charge),2) AS avg_monthly_charge
FROM telco_churn.telco_services srv
INNER JOIN telco_churn.customer_demography dmg ON srv.customer_id = dmg.customer_id
INNER JOIN telco_churn.customer_status sts ON srv.customer_id = sts.customer_id
GROUP BY sts.status, dmg.gender, dmg.married
ORDER BY sts.status, dmg.gender, dmg.married

#### <i><b><span style='color:#55679C'>Example : </span>Calculate the average tenure_in_month for each customer status! Show status, total_customer, avg_tenure_in_month

In [ ]:
SELECT
	  cs.status,
	  COUNT(srv.customer_id) AS total_customer,
	  ROUND(AVG(srv.tenure_in_months),2) AS avg_tenure_in_month
	FROM `telco_churn.telco_services` AS srv
	LEFT JOIN `telco_churn.customer_status` AS cs ON srv.customer_id = cs.customer_id
	GROUP BY cs.status

#### <i><b><span style='color:#55679C'>Example : </span>Telecommunication companies want to expand their market to several areas where there are no registered customers in the database. Create a list of postal codes in the population table where no one uses telecommunications services at all! Display the postal codes and their population number

In [ ]:
	SELECT DISTINCT
	  loc.zip_code AS zip_code_from_cust,
	  pop.zip_code,
	  pop.population
	FROM telco_churn.customer_location AS loc
	RIGHT JOIN telco_churn.population AS pop ON loc.zip_code = pop.zip_code
	WHERE loc.zip_code IS NULL;


<a href="https://www.linkedin.com/in/muhamad-arief-ramadhan-0603b3138/"><img src="https://img.shields.io/badge/-© 2025 Muhamad Arief Ramadhan-417DAC?style=for-the-badge&logoColor=white"/></a>